Revit 2026 API

# BuiltInFailuresCutterFailures Class

---

Failures about Cutter.

SystemObject Autodesk.Revit.DBBuiltInFailuresCutterFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class CutterFailures
```
```vb
Public NotInheritable Class CutterFailures
```
```cpp
public ref class CutterFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CutterFailures = class end
```

The BuiltInFailuresCutterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MakeCutterForPlanRegionsGStepFailed | Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions. |
|  | MakeCutterForSectionGStepFailed | Attempt to create or manipulate a segmented section has failed. |

#### Reference

Autodesk.Revit.DB Namespace